---
kind: property
id: P:Autodesk.Revit.DB.Visual.Marble.MarbleColor2
source: html/0543210a-c3b9-39e8-dd7a-939a7cc6d329.htm
---
# Autodesk.Revit.DB.Visual.Marble.MarbleColor2 Property

The property labeled "Vein Color" from the "Marble" schema.

## Syntax (C#)
```csharp
public static string MarbleColor2 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.